
var gatData=[{
    "children": [
        {
            "children": [
                {
                    "710101": "中正区",
                },
                {
                    "710102": "大同区",
                },
                {
                    "710103": "中山区",
                    "code": "710103"
                },
                {
                    "710104": "松山区",
                    "code": "710104"
                },
                {
                    "name": "大安区",
                    "code": "710105"
                },
                {
                    "name": "万华区",
                    "code": "710106"
                },
                {
                    "name": "信义区",
                    "code": "710107"
                },
                {
                    "name": "士林区",
                    "code": "710108"
                },
                {
                    "name": "北投区",
                    "code": "710109"
                },
                {
                    "name": "内湖区",
                    "code": "710110"
                },
                {
                    "name": "南港区",
                    "code": "710111"
                },
                {
                    "name": "文山区",
                    "code": "710112"
                },
                {
                    "name": "其它区",
                    "code": "710113"
                }
            ],
            "710100": "台北市"
        },
        {
            "children": [
                {
                    "name": "新兴区",
                    "code": "710201"
                },
                {
                    "name": "前金区",
                    "code": "710202"
                },
                {
                    "name": "芩雅区",
                    "code": "710203"
                },
                {
                    "name": "盐埕区",
                    "code": "710204"
                },
                {
                    "name": "鼓山区",
                    "code": "710205"
                },
                {
                    "name": "旗津区",
                    "code": "710206"
                },
                {
                    "name": "前镇区",
                    "code": "710207"
                },
                {
                    "name": "三民区",
                    "code": "710208"
                },
                {
                    "name": "左营区",
                    "code": "710209"
                },
                {
                    "name": "楠梓区",
                    "code": "710210"
                },
                {
                    "name": "小港区",
                    "code": "710211"
                },
                {
                    "name": "其它区",
                    "code": "710212"
                }
            ],
            "name": "高雄市",
            "code": "710200"
        },
        {
            "children": [
                {
                    "name": "中西区",
                    "code": "710301"
                },
                {
                    "name": "东区",
                    "code": "710302"
                },
                {
                    "name": "南区",
                    "code": "710303"
                },
                {
                    "name": "北区",
                    "code": "710304"
                },
                {
                    "name": "安平区",
                    "code": "710305"
                },
                {
                    "name": "安南区",
                    "code": "710306"
                },
                {
                    "name": "其它区",
                    "code": "710307"
                }
            ],
            "name": "台南市",
            "code": "710300"
        },
        {
            "children": [
                {
                    "name": "中区",
                    "code": "710401"
                },
                {
                    "name": "东区",
                    "code": "710402"
                },
                {
                    "name": "南区",
                    "code": "710403"
                },
                {
                    "name": "西区",
                    "code": "710404"
                },
                {
                    "name": "北区",
                    "code": "710405"
                },
                {
                    "name": "北屯区",
                    "code": "710406"
                },
                {
                    "name": "西屯区",
                    "code": "710407"
                },
                {
                    "name": "南屯区",
                    "code": "710408"
                },
                {
                    "name": "其它区",
                    "code": "710409"
                }
            ],
            "name": "台中市",
            "code": "710400"
        },
        {
            "name": "金门县",
            "code": "710500"
        },
        {
            "name": "南投县",
            "code": "710600"
        },
        {
            "children": [
                {
                    "name": "仁爱区",
                    "code": "710701"
                },
                {
                    "name": "信义区",
                    "code": "710702"
                },
                {
                    "name": "中正区",
                    "code": "710703"
                },
                {
                    "name": "中山区",
                    "code": "710704"
                },
                {
                    "name": "安乐区",
                    "code": "710705"
                },
                {
                    "name": "暖暖区",
                    "code": "710706"
                },
                {
                    "name": "七堵区",
                    "code": "710707"
                },
                {
                    "name": "其它区",
                    "code": "710708"
                }
            ],
            "name": "基隆市",
            "code": "710700"
        },
        {
            "children": [
                {
                    "name": "东区",
                    "code": "710801"
                },
                {
                    "name": "北区",
                    "code": "710802"
                },
                {
                    "name": "香山区",
                    "code": "710803"
                },
                {
                    "name": "其它区",
                    "code": "710804"
                }
            ],
            "name": "新竹市",
            "code": "710800"
        },
        {
            "children": [
                {
                    "name": "东区",
                    "code": "710901"
                },
                {
                    "name": "西区",
                    "code": "710902"
                },
                {
                    "name": "其它区",
                    "code": "710903"
                }
            ],
            "name": "嘉义市",
            "code": "710900"
        },
        {
            "name": "新北市",
            "code": "711100"
        },
        {
            "name": "宜兰县",
            "code": "711200"
        },
        {
            "name": "新竹县",
            "code": "711300"
        },
        {
            "name": "桃园县",
            "code": "711400"
        },
        {
            "name": "苗栗县",
            "code": "711500"
        },
        {
            "name": "彰化县",
            "code": "711700"
        },
        {
            "name": "嘉义县",
            "code": "711900"
        },
        {
            "name": "云林县",
            "code": "712100"
        },
        {
            "name": "屏东县",
            "code": "712400"
        },
        {
            "name": "台东县",
            "code": "712500"
        },
        {
            "name": "花莲县",
            "code": "712600"
        },
        {
            "name": "澎湖县",
            "code": "712700"
        }
    ],
    "name": "台湾省",
    "code": "71"
},
{
    "children": [
        {
            "children": [
                {
                    "name": "中西区",
                    "code": "810101"
                },
                {
                    "name": "湾仔",
                    "code": "810102"
                },
                {
                    "name": "东区",
                    "code": "810103"
                },
                {
                    "name": "南区",
                    "code": "810104"
                }
            ],
            "name": "香港岛",
            "code": "810100"
        },
        {
            "children": [
                {
                    "name": "九龙城区",
                    "code": "810201"
                },
                {
                    "name": "油尖旺区",
                    "code": "810202"
                },
                {
                    "name": "深水埗区",
                    "code": "810203"
                },
                {
                    "name": "黄大仙区",
                    "code": "810204"
                },
                {
                    "name": "观塘区",
                    "code": "810205"
                }
            ],
            "name": "九龙",
            "code": "810200"
        },
        {
            "children": [
                {
                    "name": "北区",
                    "code": "810301"
                },
                {
                    "name": "大埔区",
                    "code": "810302"
                },
                {
                    "name": "沙田区",
                    "code": "810303"
                },
                {
                    "name": "西贡区",
                    "code": "810304"
                },
                {
                    "name": "元朗区",
                    "code": "810305"
                },
                {
                    "name": "屯门区",
                    "code": "810306"
                },
                {
                    "name": "荃湾区",
                    "code": "810307"
                },
                {
                    "name": "葵青区",
                    "code": "810308"
                },
                {
                    "name": "离岛区",
                    "code": "810309"
                }
            ],
            "name": "新界",
            "code": "810300"
        }
    ],
    "name": "香港特别行政区",
    "code": "81"
},


{
    81:{
        n:"香港特别行政区",
        c:{
            810100:{
                n:"香港岛",
                c:{
                    810101:"中西区",
                    810102:"湾仔",
                    810103:"东区",
                    810104:"南区"
                }
            },
            810200:{
                n:"九龙",
                c:{
                    810201:"九龙城区",
                    810202:"油尖旺区",
                    810203:"深水埗区",
                    810204:"黄大仙区",
                    810205:"观塘区"
                }
            },
            810300:{
                n:"新界",
                c:{
                    810301:"北区",
                    810302:"大埔区",
                    810303:"沙田区",
                    810304:"西贡区",
                    810305:"元朗区",
                    810306:"屯门区",
                    810307:"荃湾区",
                    810308:"葵青区",
                    810309:"离岛区"
                }
            }

        }
    },
    82: {
        n:"澳门特别行政区",
        c:{
            820100: "澳门半岛",
            820200: "离岛"
        }
    },
    71:{
        n:"台湾省",
        c:{
            710100:{
                n:"台北市",
                c:{
                    710101:"中正区",
                    710102:"大同区",
                    710103:"中山区",
                    710104:"松山区",
                    710105:"大安区",
                    710106:"万华区",
                    710107:"信义区",
                    710108:"士林区",
                    710109:"北投区",
                    710110:"内湖区",
                    710111:"南港区",
                    710112:"文山区",
                    710113:"其它区"
                }
            },
            710200:{
                n:"高雄市",
                c:{
                    710201:"新兴区",
                    710202:"前金区",
                    710203:"芩雅区",
                    710204:"盐埕区",
                    710205:"鼓山区",
                    710206:"旗津区",
                    710207:"前镇区",
                    710208:"三民区",
                    710209:"左营区",
                    710210:"楠梓区",
                    710211:"小港区",
                    710212:"其它区"
                }
            },
            710300:{
                n:"台南市",
                c:{
                    710301:"中西区",
                    710301:"东区",
                    710301:"南区",
                    710301:"北区",
                    710301:"安平区",
                    710301:"安南区",
                    710301:"其它区"
                }
            },
            710400:"台中市",
            710500:"金门县",
            710600:"南投县",
            710700:"基隆市",
            710800:"新竹市",
            710900:"嘉义市",
            711100:"新北市",
            711200:"宜兰县",
            711300:"新竹县",
            
        }
    }     
}];

exports.data=gatData;

